wos/woklite.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:woksearchlite="http://woksearchlite.v3.wokmws.thomsonreuters.com">
   <soapenv:Header/>
   <soapenv:Body>
      <woksearchlite:search>
         <queryParameters>
            <databaseId>WOS</databaseId>
            <userQuery>TS=(cadmium OR lead)</userQuery>
            <editions>
               <collection>WOS</collection>
               <edition>SCI</edition>
            </editions>
            <timeSpan>
               <begin>2000-01-01</begin>
               <end>2011-12-31</end>
            </timeSpan>
            <queryLanguage>en</queryLanguage>
         </queryParameters>
         <retrieveParameters>
            <firstRecord>1</firstRecord>
            <count>10</count>
         </retrieveParameters>
      </woksearchlite:search>
   </soapenv:Body>
</soapenv:Envelope>